In [20]:
import pandas as pd

## Data Manipulation

### Adding

In [21]:
data = {
    "Name" : ['Shiv','Ram','Shyam','Ghanshyam','Krishna','Jagdish','Raj','Mayur'],
    "Age" : [28,34,22,30,29,40,25,32],
    "Salary" : [50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance Score" : [85,90,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)
print()

# adding Data using assignment
df["Bonus"] = df["Salary"] * 0.1 # Here we are creating new column bonus and doing some operations
print("After adding Bonus Column :->\n",df) 
print()

# Using Insert Method    -> insert(location(index_number),"columnName",some_data)

# Inserting employeeif using insert method

df.insert(0,"Employee ID",['E01','E02','E03','E04','E05','E06','E07','E08'])
print("After Adding Employee ID :-> \n",df)

        Name  Age  Salary  Performance Score
0       Shiv   28   50000                 85
1        Ram   34   60000                 90
2      Shyam   22   45000                 78
3  Ghanshyam   30   52000                 92
4    Krishna   29   49000                 88
5    Jagdish   40   70000                 95
6        Raj   25   48000                 80
7      Mayur   32   58000                 89

After adding Bonus Column :->
         Name  Age  Salary  Performance Score   Bonus
0       Shiv   28   50000                 85  5000.0
1        Ram   34   60000                 90  6000.0
2      Shyam   22   45000                 78  4500.0
3  Ghanshyam   30   52000                 92  5200.0
4    Krishna   29   49000                 88  4900.0
5    Jagdish   40   70000                 95  7000.0
6        Raj   25   48000                 80  4800.0
7      Mayur   32   58000                 89  5800.0

After Adding Employee ID :->
   Employee ID       Name  Age  Salary  Performance Score   Bonus
0         E01       Shiv   28   50000                 85  5000.0
1         E02        Ram   34   60000                 90  6000.0
2         E03      Shyam   22   45000                 78  4500.0
3         E04  Ghanshyam   30   52000                 92  5200.0
4         E05    Krishna   29   49000                 88  4900.0
5         E06    Jagdish   40   70000                 95  7000.0
6         E07        Raj   25   48000                 80  4800.0
7         E08      Mayur   32   58000                 89  5800.0

### Updating

In [13]:
print(df)

# .loc[] -  This method is use for acessing particular cell and able to do modifications
# Syntax : df.loc[row_index,"Column_Name"] = New Value

print()
df.loc[0,"Salary"] = 55000
print(df)
print()

# Increasing salary by 5%
df["Salary"] = df["Salary"] * 1.05
print("After Incrasing Salary by 5% :-> \n",df)

  Employee ID       Name  Age   Salary  Performance Score   Bonus
0         E01       Shiv   28  57750.0                 85  5000.0
1         E02        Ram   34  63000.0                 90  6000.0
2         E03      Shyam   22  47250.0                 78  4500.0
3         E04  Ghanshyam   30  54600.0                 92  5200.0
4         E05    Krishna   29  51450.0                 88  4900.0
5         E06    Jagdish   40  73500.0                 95  7000.0
6         E07        Raj   25  50400.0                 80  4800.0
7         E08      Mayur   32  60900.0                 89  5800.0

  Employee ID       Name  Age   Salary  Performance Score   Bonus
0         E01       Shiv   28  55000.0                 85  5000.0
1         E02        Ram   34  63000.0                 90  6000.0
2         E03      Shyam   22  47250.0                 78  4500.0
3         E04  Ghanshyam   30  54600.0                 92  5200.0
4         E05    Krishna   29  51450.0                 88  4900.0
5         E06    Jagdish   40  73500.0                 95  7000.0
6         E07        Raj   25  50400.0                 80  4800.0
7         E08      Mayur   32  60900.0                 89  5800.0

After Incrasing Salary by 5% :->
   Employee ID       Name  Age   Salary  Performance Score   Bonus
0         E01       Shiv   28  57750.0                 85  5000.0
1         E02        Ram   34  66150.0                 90  6000.0
2         E03      Shyam   22  49612.5                 78  4500.0
3         E04  Ghanshyam   30  57330.0                 92  5200.0
4         E05    Krishna   29  54022.5                 88  4900.0
5         E06    Jagdish   40  77175.0                 95  7000.0
6         E07        Raj   25  52920.0                 80  4800.0
7         E08      Mayur   32  63945.0                 89  5800.0

### Removing

In [19]:
# Drop method is use for deleting any column and any row
# Syntax : df.drop(columns = ["ColumnName"], inplace =True) 
# Inplace = True means, modify original data from directly. Inplace = False return new dataset.

print(df)

print()

#Single Column Remove
df.drop(columns=["Bonus"], inplace=True)
print(df)
print()

# Multiple Coulmn Remove
df.drop(columns=["Age","Performance Score"], inplace=True)
print(df)

  Employee ID       Name  Age  Salary  Performance Score   Bonus
0         E01       Shiv   28   50000                 85  5000.0
1         E02        Ram   34   60000                 90  6000.0
2         E03      Shyam   22   45000                 78  4500.0
3         E04  Ghanshyam   30   52000                 92  5200.0
4         E05    Krishna   29   49000                 88  4900.0
5         E06    Jagdish   40   70000                 95  7000.0
6         E07        Raj   25   48000                 80  4800.0
7         E08      Mayur   32   58000                 89  5800.0

  Employee ID       Name  Age  Salary  Performance Score
0         E01       Shiv   28   50000                 85
1         E02        Ram   34   60000                 90
2         E03      Shyam   22   45000                 78
3         E04  Ghanshyam   30   52000                 92
4         E05    Krishna   29   49000                 88
5         E06    Jagdish   40   70000                 95
6         E07        Raj   25   48000                 80
7         E08      Mayur   32   58000                 89

  Employee ID       Name  Salary
0         E01       Shiv   50000
1         E02        Ram   60000
2         E03      Shyam   45000
3         E04  Ghanshyam   52000
4         E05    Krishna   49000
5         E06    Jagdish   70000
6         E07        Raj   48000
7         E08      Mayur   58000


# Missing Data Handling

### Identify Missing Data

NaN (Not a Number)

Methods:

step-1 Identify at which place data is missing

isnull() :  For Identify the missing data and it returns Boolean data True or False.

            Here, True Means Data is missing at that place and False Means Data is not Missing

In [25]:
data = {
    "Name" : ['Shiv','Ram','Shyam',None,'Krishna','Jagdish','Raj','Mayur'],
    "Age" : [28,34,22,None,29,40,25,32],
    "Salary" : [50000,60000,45000,None,49000,70000,48000,58000],
    "Performance Score" : [85,90,78,None,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)
print()

print(df.isnull())  # This method is used for identify where the data is missing
print()
print(df.isnull().sum())  # This Method is used for checking how many data missing in column

      Name   Age   Salary  Performance Score
0     Shiv  28.0  50000.0               85.0
1      Ram  34.0  60000.0               90.0
2    Shyam  22.0  45000.0               78.0
3     None   NaN      NaN                NaN
4  Krishna  29.0  49000.0               88.0
5  Jagdish  40.0  70000.0               95.0
6      Raj  25.0  48000.0               80.0
7    Mayur  32.0  58000.0               89.0

    Name    Age  Salary  Performance Score
0  False  False   False              False
1  False  False   False              False
2  False  False   False              False
3   True   True    True               True
4  False  False   False              False
5  False  False   False              False
6  False  False   False              False
7  False  False   False              False

Name                 1
Age                  1
Salary               1
Performance Score    1
dtype: int64

### Missing Data Handling

After Detacting Missing Data we have two option.

Option 1 : Remove Data

Option 2 : Fill Data with Some Value


   Removing Data, After removing data it does not effect on you dataset or that data is not necessary for analysis then remove Data

   dropna() : Is method for removing Data

   Syntax :  dropna(axis = 0 , inplace = True)  
   \
   axis = O Means, Removing Rows and axis =1 Means removing columns
   
   fillna() : Is method use for filling some value at missing value place

   Syntax() : fillna( Value , inplace = True)  

   Here, at the place of value we have to right default value

In [ ]:
data = {
    "Name" : ['Shiv','Ram','Shyam',None,'Krishna','Jagdish','Raj','Mayur'],
    "Age" : [28,34,22,None,29,40,25,32],
    "Salary" : [50000,60000,45000,None,49000,70000,48000,58000],
    "Performance Score" : [85,90,78,None,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)
print()

df.dropna(axis=0 , inplace=True)  # This removes None data from row
print(df)

      Name   Age   Salary  Performance Score
0     Shiv  28.0  50000.0               85.0
1      Ram  34.0  60000.0               90.0
2    Shyam  22.0  45000.0               78.0
3     None   NaN      NaN                NaN
4  Krishna  29.0  49000.0               88.0
5  Jagdish  40.0  70000.0               95.0
6      Raj  25.0  48000.0               80.0
7    Mayur  32.0  58000.0               89.0

      Name   Age   Salary  Performance Score
0     Shiv  28.0  50000.0               85.0
1      Ram  34.0  60000.0               90.0
2    Shyam  22.0  45000.0               78.0
4  Krishna  29.0  49000.0               88.0
5  Jagdish  40.0  70000.0               95.0
6      Raj  25.0  48000.0               80.0
7    Mayur  32.0  58000.0               89.0

### Filling Default Value

In [37]:
data = {
    "Name" : ['Shiv','Ram','Shyam',None,'Krishna','Jagdish','Raj','Mayur'],
    "Age" : [28,34,22,None,29,40,25,32],
    "Salary" : [50000,60000,45000,None,49000,70000,48000,58000],
    "Performance Score" : [85,90,78,None,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)
print()



# Filling Default Value at the place of NaN 


df["Age"].fillna(df["Age"].mean(),inplace=True)
print(df)
print()

print("Set Salary At place of NaN :-> \n")
df["Salary"].fillna(df["Salary"].mean(),inplace=True)
print(df)

      Name   Age   Salary  Performance Score
0     Shiv  28.0  50000.0               85.0
1      Ram  34.0  60000.0               90.0
2    Shyam  22.0  45000.0               78.0
3     None   NaN      NaN                NaN
4  Krishna  29.0  49000.0               88.0
5  Jagdish  40.0  70000.0               95.0
6      Raj  25.0  48000.0               80.0
7    Mayur  32.0  58000.0               89.0

      Name   Age   Salary  Performance Score
0     Shiv  28.0  50000.0               85.0
1      Ram  34.0  60000.0               90.0
2    Shyam  22.0  45000.0               78.0
3     None  30.0      NaN                NaN
4  Krishna  29.0  49000.0               88.0
5  Jagdish  40.0  70000.0               95.0
6      Raj  25.0  48000.0               80.0
7    Mayur  32.0  58000.0               89.0

Set Salary At place of NaN :->

      Name   Age        Salary  Performance Score
0     Shiv  28.0  50000.000000               85.0
1      Ram  34.0  60000.000000               90.0
2    Shyam  22.0  45000.000000               78.0
3     None  30.0  54285.714286                NaN
4  Krishna  29.0  49000.000000               88.0
5  Jagdish  40.0  70000.000000               95.0
6      Raj  25.0  48000.000000               80.0
7    Mayur  32.0  58000.000000               89.0

### InterPolation

##### Interpolation is used for fill estimate value at place of NaN and it is work only on Numeric Value

##### Syntax : interpolate(method, axis , inplcae=True)

In [39]:
data = {
    "Name" : ['Shiv','Ram','Shyam','Ghanshyam','Krishna','Jagdish','Raj','Mayur'],
    "Age" : [28,34,22,None,29,40,25,32],
    "Salary" : [50000,60000,45000,None,49000,70000,48000,58000],
    "Performance Score" : [85,90,78,None,88,95,80,89]
}

df = pd.DataFrame(data)
print("Before interpolation..")
print(df)
print()

print("After Interpolation..")
df.interpolate(method='linear',axis=0,inplace=True)
print(df)

Before interpolation..
        Name   Age   Salary  Performance Score
0       Shiv  28.0  50000.0               85.0
1        Ram  34.0  60000.0               90.0
2      Shyam  22.0  45000.0               78.0
3  Ghanshyam   NaN      NaN                NaN
4    Krishna  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7      Mayur  32.0  58000.0               89.0

After Interpolation..
        Name   Age   Salary  Performance Score
0       Shiv  28.0  50000.0               85.0
1        Ram  34.0  60000.0               90.0
2      Shyam  22.0  45000.0               78.0
3  Ghanshyam  25.5  47000.0               83.0
4    Krishna  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7      Mayur  32.0  58000.0               89.0